/* 숲 속 마을에서 식목일 행사로 나무 심기 대회가 열렸다.
가장 많이 나무를 심은 동물에게 평균 나무 심은 횟수를 뺀 수만큼
과일을 주기로 했다. 대회의 우승자와 상품으로 받을 과일의 갯수는?
ex) 평균 횟수: 20회, 가장 많이 심은 횟수 30회 = 상품 과일 10개 증정.
ex) 우승자는 토끼 입니다. 상품으로 과일 10개를 받아가세요! */
// const animalList = [
//   {
//     name: "토끼",
//     count: 15
//   },
//   {
//     name: "사슴",
//     count: 8
//   },
//   {
//     name: "호랑이",
//     count: 32
//   },
//   {
//     name: "멧돼지",
//     count: 5
//   },
//   {
//     name: "산양",
//     count: 21
//   },
//   {
//     name: "늑대",
//     count: 29
//   },
//   {
//     name: "여우",
//     count: 33
//   },
//   {
//     name: "청설모",
//     count: 2
//   },
//   {
//     name: "곰",
//     count: 26
//   },
//   {
//     name: "꿩",
//     count: 19
//   }
// ]

// let maxNum = 0;
// let winner = "";
// let totalCount = 0;

// ------------------------------------------------------------------------------
/* 7개의 수가 주어지면 그 숫자중 가장 작은 수를 출력하는 프로그램을 만드시오
ex) arr [5,3,7,11,21,15,17]  이중에서는 3이 나와야겠죠
조건 : for문과 그안의 if문을 사용해주세요 */
// function solution(arr){

// }

// let arr=[5, 7, 1, 3, 2, 9, 11];
// console.log(solution(arr));

// ------------------------------------------------------------------------------
/* 숫자배열을 만들고자 한다. 
이 숫자배열은 자연수N까지의 숫자를 순서대로 나열한 배열이다.
임의 자연수 N을 넣었을 떄 숫자배열을 출력해보자. */

// ------------------------------------------------------------------------------
/* 중첩 for문을 사용하세요
if문을 사용하네요
주사위의 합이 6이 되는 경우의 수를 모두 출력하세요 */

// ------------------------------------------------------------------------------
// 마시멜로 150개가 있습니다.
// 소영은 첫날 1개를 받고, 다음날에는 전날의 2개를 더 받습니다.
// 재현은 첫날 5개를 받고, 다음날에는 전날의 1개를 더 받습니다.
// 더 나누어 가질 수 없을 때까지 받았을 때, 각자가 받은 총 마시멜로 개수와, 둘이 받은 총 개수를 출력할 수 있도록 코드를 작성해 주세요.
// let 소영 = 0
// let 재현 = 0
// let 총합 = 0
// 이외 필요한 변수는 자유롭게 추가해 주세요!

// 이 부분에 코드를 추가해 주세요!

// console.log(`소영이 가져간 총 갯수는 ${소영}`)
// console.log(`재현이 가져간 총 갯수는 ${재현}`)
// console.log(`둘이 가져간 총 갯수는 ${총합}`)

// ------------------------------------------------------------------------------
// 1. 예시에 있는 배열을 거꾸로하여 새로운 배열에 넣어 출력해보세요.
// 2. reverse() 말고 for문을 사용해보세요.
// 3. 아래 예제 코드로 하시면 되고, 출력은 console.log()로 해보세요.
// 예제 코드
// const array = ["apple","mango","banana","orange"]

// ------------------------------------------------------------------------------
